In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('heights.csv')

In [4]:
df.head()

    name  height
0  mohan     1.2
1  maria     4.6
2  sakib     4.9
3    tao     5.1
4  virat     5.2

In [7]:
q1, q3,= df.height.quantile([0.25,0.75])
q1,q3

(5.3500000000000005, 6.275)

In [8]:
iqr = q3-q1

In [9]:
lower = q1-1.5*iqr
higher= q3+1.5*iqr
lower, higher

(3.962500000000001, 7.6625)

In [10]:
df[(df.height<lower)|(df.height>higher)]

     name  height
0   mohan     1.2
19    Liu    40.2

In [11]:
df_new = df[(df.height>lower)&(df.height<higher)]
df_new

       name  height
1     maria     4.6
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     6.6
17    aamir     7.1
18      ken     7.1

In [12]:
df = pd.read_excel('region_wise_sales.xlsx')
df.head()

      Month  Year Region  Sales
0   January  2022   APAC  36750
1  February  2022   APAC  36995
2     March  2022   APAC  18579
3     April  2022   APAC  37768
4       May  2022   APAC  23956

In [15]:
labels = df['Region'].unique()
labels

array(['APAC', 'Europe', 'Americas'], dtype=object)

In [16]:
plot_data = [df['Sales'][df['Region'] == label].values for label in labels]
plot_data

[array([36750, 36995, 18579, 37768, 23956, 38143, 29132, 21961, 33299,
        37279, 21388, 21896]),
 array([ 9665, 10297, 11079, 13410, 11229, 15352, 13286, 11470, 11873,
        23000, 12215, 14895]),
 array([30247, 29284, 27904, 23407, 23716, 25077, 33649, 24560, 34102,
        28257, 30691, 29387])]